# The Pandas DataFrame: Make Working With Data Delightful

**Article Link: https://realpython.com/pandas-dataframe/**  

In this tutorial, youâ€™ll learn:

* What a Pandas DataFrame is and how to create one
* How to access, modify, add, sort, filter, and delete data
* How to handle missing values
* How to work with time-series data
* How to quickly visualize data

In [116]:
import pandas as pd
import numpy as np

## Intro

In [117]:
# create a smaple dataframe from dictionary
user_data = {
    'name': ['Ananth', 'John', 'Wong', 'Souza', 'Jane'],
    'age': [21, 27, 24, 33, 19],
    'skill': ['data science', 'machine learning', 'front end designing', 'UI and UX', '3D modelling'],
    'country': ['Sri Lanka', 'United Kingdom', 'China', 'Netherlands', 'USA'],
    'is_disabled': [True, False, False, False, True]
    }
row_labels = ['a', 'b', 'c', 'd', 'e']


df0 = pd.DataFrame(user_data, index=row_labels)

display(df0)

     name  age                skill         country  is_disabled
a  Ananth   21         data science       Sri Lanka         True
b    John   27     machine learning  United Kingdom        False
c    Wong   24  front end designing           China        False
d   Souza   33            UI and UX     Netherlands        False
e    Jane   19         3D modelling             USA         True

In [118]:
# if the column name is a valid Python identifier, the column can be accessd using dot notation
display(df0.skill)

a           data science
b       machine learning
c    front end designing
d              UI and UX
e           3D modelling
Name: skill, dtype: object

In [119]:
# using index like dicitoinary key
display(df0.skill['c'])

# this won't work
# display(df0['b'])

# instead, loc can be used
df0.loc['c']

'front end designing'

name                          Wong
age                             24
skill          front end designing
country                      China
is_disabled                  False
Name: c, dtype: object

In [120]:
df = pd.DataFrame(user_data)

## Creating a Pandas DataFrame

In [121]:
# from a dicitionary
dict1 = {"x": [1, 2, 3],
         "y": np.array([2, 4, 6]),
         "z": 100}  

df1 = pd.DataFrame(dict1)
display(df1)

   x  y    z
0  1  2  100
1  2  4  100
2  3  6  100

In [122]:
# from a list of dictionaries
list2 = [
    {'x': 1, 'y': 2, 'z': 3},
    {'x': 4, 'y': 5, 'z': 6},
    {'x': 7, 'y': 8, 'z': 9}
]
df2 = pd.DataFrame(list2)
display(df2)


#  this one won't work properly
list3 = [
    {'x': 1, 'x': 2, 'x': 3},
    {'y': 4, 'y': 5, 'y': 6},
    {'z': 7, 'z': 8, 'z': 9}
]
df3 = pd.DataFrame(list3)
display(df3)


# from a list of lists
list4 = [
    [11, 22, 33],
    [14, 25, 36],
    [17, 30, 39]
]
df4 = pd.DataFrame(list4, columns=['x', 'y', 'z'])  # column names have to passed in explicitly, otherwise they would be auto named using integers, like index
display(df4)

   x  y  z
0  1  2  3
1  4  5  6
2  7  8  9

     x    y    z
0  3.0  NaN  NaN
1  NaN  6.0  NaN
2  NaN  NaN  9.0

    x   y   z
0  11  22  33
1  14  25  36
2  17  30  39

In [123]:
# from a numpy array
# only a 2 dimensional array would work in this case, any other dimensional arrays would result in a ValueError

arr5 = np.array(
    [
        [1, 10, 100],
        [2, 20, 200],
        [3, 30, 300]
    ]
)

# the following array, if passed into the df constructor fucntion, it would result in the following error
# ValueError: Must pass 2-d input. shape=(3, 3, 3)
arr_err1 = np.array(
    [
        [[1, 10, 100], [2, 20, 200], [3, 30, 300]],
        [[1, 10, 100], [2, 20, 200], [3, 30, 300]],
        [[1, 10, 100], [2, 20, 200], [3, 30, 300]]
    ]
)

df5 = pd.DataFrame(arr5, columns=['x', 'y', 'z'])
display(df5)

# pd.DataFrame() normally doesn't copy numpy arrays by default. so if the array is modified, the values in the dataframe would change as well
# however, this can be evaded by passing in `copy=True`

   x   y    z
0  1  10  100
1  2  20  200
2  3  30  300

In [124]:
# saving a dataframe to file on disk and reloading the dataframe from file
df0.to_csv('./user_data.csv')

dfuser = pd.read_csv('./user_data.csv', index_col=0)  # specifying the index column
display(dfuser)

     name  age                skill         country  is_disabled
a  Ananth   21         data science       Sri Lanka         True
b    John   27     machine learning  United Kingdom        False
c    Wong   24  front end designing           China        False
d   Souza   33            UI and UX     Netherlands        False
e    Jane   19         3D modelling             USA         True

## Retrieving Labels and Data

In [125]:
# get index
print(dfuser.index)

# get colum names
print(dfuser.columns)

# set index
dfuser.index = np.arange(1, 6)
print(dfuser.index)

# Update the index
# Below line has been disabled it is easier to work with a numerical index
# dfuser.index = ['a', 'b', 'c', 'd', 'e']

# a single element of df.index or df.columns can not be edited. will TypeError

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
Index(['name', 'age', 'skill', 'country', 'is_disabled'], dtype='object')
Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [126]:
# retrieving the data as numpy array
# any pandas series, dataframes or sequences can be changeed into a numpy array with the methods df.to_numpy of df.values
# however df.to_numpy() is more flexible. use copy=False if you want the values to be copied

print(dfuser.to_numpy())

print(type(dfuser.to_numpy()), type(dfuser.to_numpy()) is type(dfuser.values))

[['Ananth' 21 'data science' 'Sri Lanka' True]
 ['John' 27 'machine learning' 'United Kingdom' False]
 ['Wong' 24 'front end designing' 'China' False]
 ['Souza' 33 'UI and UX' 'Netherlands' False]
 ['Jane' 19 '3D modelling' 'USA' True]]
<class 'numpy.ndarray'> True

In [127]:
# change one/more column's dtype
dfuser = dfuser.astype({'is_disabled': object})

# get column datatypes
dfuser.dtypes

name           object
age             int64
skill          object
country        object
is_disabled    object
dtype: object

In [128]:
# dimensional depth: 1 if series, 2 if dataframe
print(dfuser.ndim)

# shape: number of rows x number of columns
print(dfuser.shape)

# size: number of individual values in the dataframe or series
print(dfuser.size)

# bytes allocated in memory
display(dfuser.memory_usage())

2
(5, 5)
25

Index          40
name           40
age            40
skill          40
country        40
is_disabled    40
dtype: int64

## Accessing and Modifying Data

In [129]:
# access a particular column
display(dfuser[['skill']])  # double set of square brackets to return a dataframe

# can use dot notation if column name is a valid python identifier
display(dfuser.name)

                 skill
1         data science
2     machine learning
3  front end designing
4            UI and UX
5         3D modelling

1    Ananth
2      John
3      Wong
4     Souza
5      Jane
Name: name, dtype: object

### Accessors

* An **accessor** method is a function that returns a copy of the internal variable or a computed value of an object.
  A **mutator** is a method that simply changes an internal value of an object.
* Pandas has four accessors in total:
  * `.loc[]` - access values by row, column labels.
  * `.iloc[]` - access values by 0 based index.
  * `.at[]` - access single value by (row, column) labels.
  * `.iat[]` - access single value by 0 based index.
* `.loc[]` and `.iloc[]` supports slicing and Numpy style indexing.

#### `.loc[]` & `.iloc[]`

In [130]:
# access a row
display(dfuser.loc[1])
display(dfuser.iloc[0])

name                 Ananth
age                      21
skill          data science
country           Sri Lanka
is_disabled            True
Name: 1, dtype: object

name                 Ananth
age                      21
skill          data science
country           Sri Lanka
is_disabled            True
Name: 1, dtype: object

In [131]:
# access a column
display(dfuser.loc[:, 'name'])
display(dfuser.iloc[:, 0])

1    Ananth
2      John
3      Wong
4     Souza
5      Jane
Name: name, dtype: object

1    Ananth
2      John
3      Wong
4     Souza
5      Jane
Name: name, dtype: object

In [132]:
# numpy-like slicing
display(dfuser.loc[1:4, ['name', 'skill']])  # rows 1 through 4, both indices are inclusive
display(dfuser.iloc[0:4, [0, 2]])  # rows 0 through 3, stop index is exclusive

     name                skill
1  Ananth         data science
2    John     machine learning
3    Wong  front end designing
4   Souza            UI and UX

     name                skill
1  Ananth         data science
2    John     machine learning
3    Wong  front end designing
4   Souza            UI and UX

#### `.at[]` & `.iat[]`

* recommended for accessing single values

In [133]:
display(dfuser.at[1, 'age'])
display(dfuser.iat[0, 1])

21

21

### Modifying Data

In [134]:
dfuser.loc[1:3, 'age'] = [95, 15, 26]  # set new value for the selected range
dfuser.iloc[3:, 1] = 30
dfuser.age

1    95
2    15
3    26
4    30
5    30
Name: age, dtype: int64

In [135]:
# reverse indexing can be used as well
dfuser.iloc[-1, 0] = 'Shaaruk'
dfuser

      name  age                skill         country is_disabled
1   Ananth   95         data science       Sri Lanka        True
2     John   15     machine learning  United Kingdom       False
3     Wong   26  front end designing           China       False
4    Souza   30            UI and UX     Netherlands       False
5  Shaaruk   30         3D modelling             USA        True

## Inserting and Deleting Data

### Inserting and deleting rows

In [136]:
# Can be created from a dictionary or other iterable as well
# The index has to be the column names this time since the dimensions are different this time
new_row = pd.Series(['Bruce', 27, 'automation', 'India', False], index=dfuser.columns)

# Append the row (Pandas Series) to the existing dataframe
# The series, created above, doesn't have a value to the name parameter.
# For such a Series object to be added to an exsiting dataframe, ignnode_index=True has to be passed in, since the Series object would have an index of null.
# By doing so, you would basically reset the index with numerals starting from 0
dfuser = dfuser.append(new_row, ignore_index=True)

C:\Users\govar\AppData\Local\Temp\ipykernel_8436\4246892851.py:9: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfuser = dfuser.append(new_row, ignore_index=True)

In [137]:
# However the above consequence can be evaded by giving the Series a name
# The name attribute of a Series acts as the index of that row in a dataset

new_row_1 = pd.Series(['Megan', 37, 'digital art', 'USA', True], index=dfuser.columns, name=9)
dfuser = dfuser.append(new_row_1)

display(dfuser)

C:\Users\govar\AppData\Local\Temp\ipykernel_8436\577093091.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfuser = dfuser.append(new_row_1)

      name  age                skill         country is_disabled
0   Ananth   95         data science       Sri Lanka        True
1     John   15     machine learning  United Kingdom       False
2     Wong   26  front end designing           China       False
3    Souza   30            UI and UX     Netherlands       False
4  Shaaruk   30         3D modelling             USA        True
5    Bruce   27           automation           India       False
9    Megan   37          digital art             USA        True

In [138]:
# Delete a row, or a set of rows
# The data to be deleted can be specified in multiple ways
#       label=n, axis=0 = Delete a row
#       label=x, axis=1 = Delete a column
#       index=n = Delete a row
#       columns=n = Delete a column

# Remove Megan's row
dfuser.drop(labels=[9], axis=0, inplace=True)
display(dfuser)

# Remove Bruce's row
dfuser.drop(index=5, inplace=True)
display(dfuser)

      name  age                skill         country is_disabled
0   Ananth   95         data science       Sri Lanka        True
1     John   15     machine learning  United Kingdom       False
2     Wong   26  front end designing           China       False
3    Souza   30            UI and UX     Netherlands       False
4  Shaaruk   30         3D modelling             USA        True
5    Bruce   27           automation           India       False

      name  age                skill         country is_disabled
0   Ananth   95         data science       Sri Lanka        True
1     John   15     machine learning  United Kingdom       False
2     Wong   26  front end designing           China       False
3    Souza   30            UI and UX     Netherlands       False
4  Shaaruk   30         3D modelling             USA        True